OF2312/Tutorial/Tertiary/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0;
        smoother        GaussSeidel;
    }

    omega
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-16;
        relTol          0;
    }

    "(U|k)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    
    C_species
    {
        solver          PBiCGStab;//PBiCG;//
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.5;//0.5;
    }

    fi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.5;//0.5;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    
    consistent      yes;

    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|epsilon|omega)" 1e-5;
        "C_.*"          1e-6;
	fi              1e-6; 
    }  
}

relaxationFactors 
{ 
    equations 
    { 	
         "C_.*"          1;
          U               0.9; // 0.9 is more stable but 0.95 more convergent
          ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    } 
    
    fields
    { 	
	  fi             0.9; 
    }
   
} 

// ************************************************************************* //
