OF2312/Tutorial/Tertiary/system/partialCurrentDensity
//*--------------------------------*- C++ -*----------------------------------*\
//| =========                 |                                                 |
//| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
//|  \\    /   O peration     | Version:  5                                     |
//|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
//|    \\/     M anipulation  |                                                 |
//\*---------------------------------------------------------------------------*/
 
partialCurrentDensity
{
        type        speciesWallFlux;//
        libs        ("libspeciesWallFluxFunctionObject.so");//
	patches     ("wall_cathode" "wall_anode");
	CName	    ox;
}

//\*---------------------------------------------------------------------------*/



